/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   libft.h                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: aakhmeto <aakhmeto@student.42heilbronn.de> +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/10/10 13:34:38 by aakhmeto          #+#    #+#             */
/*   Updated: 2025/10/10 18:11:45 by aakhmeto         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Директива препроцессора — это команда, начинающаяся с символа #,
// которую понимает препроцессор (а не компилятор).
// Препроцессор — это первая стадия обработки твоего кода, до компиляции.
// Он не исполняет код, а просто переписывает текст программы:
// вставляет файлы, удаляет куски, делает подстановки и т. д.
// Макрос — это результат работы директивы #define.

//  include guard — защита от двойного включения
// Кроме конструкции #ifndef - #endif
// иногда применяется нестандартная #pragma once

#ifndef LIBFT_H
// = “если не определено”
# define LIBFT_H
// = “определить имя”
// Почему имя макроса именно LIBFT_H?
// Так писать — просто традиция, а не обязательное правило.
// По стандарту пробел не обязателен, но рекомендуется.
// Макрос — это инструкция для препроцессора (а не для компилятора).
// Он заменяет текст в коде до начала компиляции.

# include <stdlib.h>
# include <stdio.h>
# include <unistd.h>

int		ft_isalpha(int symbol);
int		ft_isdigit(int symbol);
int		ft_isalnum(int symbol);
int		ft_isascii(int symbol);
int		ft_isprint(int symbol);
size_t	ft_strlen(const char *str);
void	*ft_memset(void *memblock, int symbol, size_t numbytes);
void	ft_bzero(void *memblock, size_t nymbytes);

#endif
// = “конец условия"
